Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 5f7057dd97d5d574b0602057725190a205d478c3
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17595068289

**Plan (last ~500 lines):**
```
 <= data "aws_subnets" "public" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:kubernetes.io/cluster/cilium"
          + values = [
              + "shared",
            ]
        }
      + filter {
          + name   = "tag:kubernetes.io/role/elb"
          + values = [
              + "1",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + "vpc-0dc4bd0445c64ace9",
            ]
        }
    }

  # module.helm.aws_iam_policy.external_dns_policy will be updated in-place
  ~ resource "aws_iam_policy" "external_dns_policy" {
        id               = "arn:aws:iam::992382578819:policy/eks-external-dns-policy"
        name             = "eks-external-dns-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.helm.aws_iam_policy.load_balancer_controller_policy will be updated in-place
  ~ resource "aws_iam_policy" "load_balancer_controller_policy" {
        id               = "arn:aws:iam::992382578819:policy/eks-load-balancer-controller-policy"
        name             = "eks-load-balancer-controller-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "elasticloadbalancing:DescribeListenerAttributes",
                          - "ec2:GetCoipPoolUsage",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeCoipPools",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:ListProtections",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeSubscription",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_ebs_csi_controller will be updated in-place
  ~ resource "aws_iam_role" "eks_ebs_csi_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::992382578819:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ebs-csi-controller-role"
        name                  = "ebs-csi-controller-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_external_dns will be updated in-place
  ~ resource "aws_iam_role" "eks_external_dns" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::992382578819:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-external-dns-role"
        name                  = "eks-external-dns-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_load_balancer_controller will be updated in-place
  ~ resource "aws_iam_role" "eks_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::992382578819:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2046A252038D570EEA3EE9832A4AD165"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-load-balancer-controller-role"
        name                  = "eks-load-balancer-controller-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.3"
              - chart          = "argo-cd"
              - first_deployed = 1757423305
              - last_deployed  = 1757423305
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file \`server.ingress.enabled\` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the \`configs.params."server.insecure"\` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs = {
                          - params = {
                              - "server.insecure" = true
                            }
                        }
                      - global  = {
                          - domain = "argocd.992382578819.realhandsonlabs.net"
                        }
                      - server  = {
                          - ingress = {
                              - annotations      = {
                                  - "external-dns.alpha.kubernetes.io/hostname"      = "argocd.992382578819.realhandsonlabs.net"
                                  - "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
                              - enabled          = true
                              - extraTls         = [
                                  - {
                                      - hosts = [
                                          - "argocd.992382578819.realhandsonlabs.net",
                                        ]
                                    },
                                ]
                              - ingressClassName = "nginx"
                            }
                        }
                    }
                )
              - version        = "5.51.6"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          - <<-EOT
                "configs":
                  "params":
                    "server.insecure": true
                "global":
                  "domain": "argocd.992382578819.realhandsonlabs.net"
                "server":
                  "ingress":
                    "annotations":
                      "external-dns.alpha.kubernetes.io/hostname": "argocd.992382578819.realhandsonlabs.net"
                      "nginx.ingress.kubernetes.io/backend-protocol": "HTTP"
                      "nginx.ingress.kubernetes.io/force-ssl-redirect": "true"
                    "enabled": true
                    "extraTls":
                    - "hosts":
                      - "argocd.992382578819.realhandsonlabs.net"
                    "ingressClassName": "nginx"
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.13.4"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1757423246
              - last_deployed  = 1757423246
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - clusterName    = "cilium"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::992382578819:role/eks-load-balancer-controller-role"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0dc4bd0445c64ace9"
                    }
                )
              - version        = "1.13.4"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "region" -> null
          - value = "us-east-1" -> null
        }
      + set {
          + name  = "region"
          + value = (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
      ~ metadata                   = [
          - {
              - app_version    = "1.17.4"
              - chart          = "cilium"
              - first_deployed = 1757423127
              - last_deployed  = 1757423127
              - name           = "cilium"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    You have successfully installed Cilium with Hubble.
                    
                    Your release version is 1.17.4.
                    
                    For any further help, visit https://docs.cilium.io/en/v1.17/gettinghelp
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - egressMasqueradeInterfaces = "eth+"
                      - endpointRoutes             = {
                          - enabled = true
                        }
                      - eni                        = {
                          - enabled = true
                        }
                      - ipam                       = {
                          - mode = "eni"
                        }
                      - k8sServiceHost             = "2046A252038D570EEA3EE9832A4AD165.gr7.us-east-1.eks.amazonaws.com"
                      - k8sServicePort             = 443
                      - kubeProxyReplacement       = true
                      - routingMode                = "native"
                    }
                )
              - version        = "1.17.4"
            },
        ] -> (known after apply)
        name                       = "cilium"
        # (27 unchanged attributes hidden)

      + set {
          + name  = "hubble.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.relay.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.method"
          + value = "helm"
        }
      + set {
          + name  = "hubble.ui.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.className"
          + value = "nginx"
        }
      + set {
          + name  = "hubble.ui.ingress.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.hosts[0]"
          + value = "hubble.992382578819.realhandsonlabs.net"
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].path"
          + value = "/"
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].pathType"
          + value = "Prefix"
        }

        # (8 unchanged blocks hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
